/**
 * 导出通用配置
 */
module.exports = {
  // 标题，此项修改后需要重启项目
  title: '人民导航',
  // 网站标题
  siteTitle: '人民导航 - 可自定义的简洁导航网站',
  // 网站加载时显示的内容
  siteLoading: '你先别急，让我先急',
  // 网站描述
  siteDescription:
    '人民导航是一个可自定义、简洁又好用的导航网站，解决了为谁做网站，为什么做网站，怎样做网站的时代之问，用户可以自定义导航、布局设置等。收录大量各类优秀网站。网站大全就选人民导航！',
  // 网站关键字
  siteKeywords:
    '人民导航,导航,导航网站,简洁,简洁导航,好用的导航网站,网站大全,知识圈,自定义导航',
  // 白名单配置，不用令牌就能访问
  whileList: ['/', '/login', '/about'],
  // 超级管理员
  superAdmin: 'superAdmin',
  // 所有权限
  allPermission: '*:*:*',
  // 备案号
  recordTitle: ''
}
